In [1]:
import numpy as np
import pandas as pd

In [2]:
manu = pd.read_csv("D:/task/MANU.csv")
manu.tail(2)

           Date       Open       High        Low      Close  Adj Close  Volume
248  2023-01-12  22.959999  23.110001  22.629999  22.770000  22.770000  428000
249  2023-01-13  22.799999  23.690001  22.799999  22.969999  22.969999  553500

In [3]:
real = pd.read_csv("D:/task/REAL.csv")
real.tail(2)

           Date  Open  High   Low  Close  Adj Close   Volume
248  2023-01-12  1.34  1.48  1.26   1.47       1.47  5096100
249  2023-01-13  1.40  1.56  1.38   1.50       1.50  3296000

In [4]:
amzn = pd.read_csv("D:/task/AMZN.csv")
amzn.tail(2)

           Date   Open       High        Low      Close  Adj Close    Volume
248  2023-01-12  96.93  97.190002  93.500000  95.269997  95.269997  85254800
249  2023-01-13  94.18  98.370003  94.120003  98.120003  98.120003  85413600

In [5]:
microsoft = pd.read_csv("D:/task/MSFT.csv")
microsoft.tail(2)

,Date,Open,High,Low,Close,Adj Close,Volume
248,2023-01-12,235.259995,239.899994,233.559998,238.509995,238.509995,27269500
249,2023-01-13,237.000000,239.369995,234.919998,239.229996,239.229996,21317700

In [6]:
nokia = pd.read_csv("D:/task/NOK.csv")
nokia.tail(2)

           Date  Open  High   Low  Close  Adj Close    Volume
248  2023-01-12  4.96  5.02  4.92   5.02       5.02  21659200
249  2023-01-13  5.00  5.04  4.99   5.03       5.03  11614700

 # Adding the new column

In [7]:
manu["Ticker"] = "manchesterunited"
manu.tail(1)

,Date,Open,High,Low,Close,Adj Close,Volume,Ticker
249,2023-01-13,22.799999,23.690001,22.799999,22.969999,22.969999,553500,manchesterunited

In [8]:
manu.columns.values

array(['Date', 'Open', 'High', 'Low', 'Close', 'Adj Close', 'Volume',
       'Ticker'], dtype=object)

In [9]:
manu= manu.loc[:,['Ticker','Date', 'Open', 'High', 'Low', 'Close', 'Adj Close', 'Volume']]
print(manu.shape)
manu.tail(1)

(250, 8)

,Ticker,Date,Open,High,Low,Close,Adj Close,Volume
249,manchesterunited,2023-01-13,22.799999,23.690001,22.799999,22.969999,22.969999,553500

In [10]:
# manu.to_csv("D:/task/after edit/MANU.csv" , index = False) if you want to save the new file

Repeat for all the files

In [11]:
real["Ticker"] = "realmadrid"
real= real.loc[:,['Ticker','Date', 'Open', 'High', 'Low', 'Close', 'Adj Close', 'Volume']]
#real.to_csv("D:/task/after edit/real.csv" , index = False)
print(real.shape)
real.tail(1)

(250, 8)

         Ticker        Date  Open  High   Low  Close  Adj Close   Volume
249  realmadrid  2023-01-13   1.4  1.56  1.38    1.5        1.5  3296000

In [12]:
amzn["Ticker"] = "amazon"
amzn= amzn.loc[:,['Ticker','Date', 'Open', 'High', 'Low', 'Close', 'Adj Close', 'Volume']]
#amzn.to_csv("D:/task/after edit/amzn.csv" , index = False)
print(amzn.shape)
amzn.tail(1)

(250, 8)

,Ticker,Date,Open,High,Low,Close,Adj Close,Volume
249,amazon,2023-01-13,94.18,98.370003,94.120003,98.120003,98.120003,85413600

In [13]:
microsoft["Ticker"] = "microsoft"
microsoft= microsoft.loc[:,['Ticker','Date', 'Open', 'High', 'Low', 'Close', 'Adj Close', 'Volume']]
#microsoft.to_csv("D:/task/after edit/microsoft.csv" , index = False)
print(microsoft.shape)
microsoft.tail(1)

(250, 8)

,Ticker,Date,Open,High,Low,Close,Adj Close,Volume
249,microsoft,2023-01-13,237.0,239.369995,234.919998,239.229996,239.229996,21317700

In [14]:
nokia["Ticker"] = "nokia"
nokia= nokia.loc[:,['Ticker','Date', 'Open', 'High', 'Low', 'Close', 'Adj Close', 'Volume']]
# nokia.to_csv("D:/task/after edit/nokia.csv" , index = False)
print(nokia.shape)
nokia.tail(1)

(250, 8)

    Ticker        Date  Open  High   Low  Close  Adj Close    Volume
249  nokia  2023-01-13   5.0  5.04  4.99   5.03       5.03  11614700

Merge the Files

In [15]:
stock = pd.concat([manu,real,amzn,microsoft,nokia])

In [20]:
print(stock.shape)  # each file is 250 row, 250*5=1250
stock.head(1)

(1250, 8)

             Ticker        Date   Open   High    Low  Close  Adj Close  Volume
0  manchesterunited  2022-01-18  14.08  14.39  14.04  14.06  13.959412  363600

In [22]:
stock.tail(1)

    Ticker        Date  Open  High   Low  Close  Adj Close    Volume
249  nokia  2023-01-13   5.0  5.04  4.99   5.03       5.03  11614700

In [17]:
stock.to_csv("D:/task/stock.csv" , index = False)